'''
创建一个夸夸群
'''

import time

# start ----------------------------------- 获取用户信息 ----------------------------------- start
hero = input('输入你的名字:')
gf = input('输入女友/男友的名字:')
boss = input('输入老板的名字:')
#   end ----------------------------------- 获取用户信息 ----------------------------------- end


# start ----------------------------------- 认证通过开夸 ----------------------------------- start
test = input('进群验证，你是谁？')
if hero == test:
    print('______________________________________________________________________')
    time.sleep(1)
    print(' ')
    print('恭候{}大驾光临'.format(hero)+'\n')
    time.sleep(1.5)
    print('群主：第一次听到{}这个名字的时候就知道，你一定非常优秀'.format(hero)+'\n')
    time.sleep(2)
    print('{}:I love you three thousand times，{}'.format(gf,hero)+'\n')
    time.sleep(2)
    print('{}:终有一天，你将担任ceo，迎娶白富美，走上人生巅峰'.format(boss)+'\n')
    time.sleep(2)
    print('王健林:{}，我很看好你，一定会很快完成一个小目标，赚上一个亿'.format(hero)+'\n')
    time.sleep(2)
    print('七大姑八大姨:看看人家{}，年少有为，多和人家学学'.format(hero))
    time.sleep(2)
    print(' ')
    print('______________________________________________________________________')
#   end ----------------------------------- 认证通过开夸 ----------------------------------- end


# start ----------------------------------- 认证失败 ----------------------------------- start
else:
    print('______________________________________________________________________')
    time.sleep(1)
    print('你不是天选之人，进群失败')
#   end ----------------------------------- 认证失败 ----------------------------------- end
